from django import forms

section_CHOICES = (
    ('all', 'Всі секції'),
    ('Природничі науки', 'Природничі науки'),
    ('Інформаційні технології', 'Інформаційні технології'),
    ('Механічна інженерія', 'Механічна інженерія'),
    ('Електрична інженерія', 'Електрична інженерія'),
    ('Автоматизація та приладобудування', 'Автоматизація та приладобудування'),
    ('Хімічна та біоінженерія', 'Хімічна та біоінженерія'),
    ('Електроніка та телекомунікації', 'Електроніка та телекомунікації'),
    ('Виробництво та технології', 'Виробництво та технології'),
    ('Архітектура та будівництв о', 'Архітектура та будівництво'),
    ('Цивільна безпека', 'Цивільна безпека'),
    ('Транспорт', 'Транспорт'),
)


class ThesisFilterForm(forms.Form):
    section = forms.ChoiceField(
        label='Секція',
        choices=section_CHOICES,
        required=False,
        widget=forms.Select(attrs={'onchange': 'this.form.submit();'})
    )
